# 1. Перечислить методы списка (list)
# append, insert, pop, extend, sort, reverse, remove
# 2. Написать их через запятую с параметрами
# append(el), insert(idx, el), pop(idx), extend(el), sort(key, reverse), reverse(), remove(el)
# 3. Отсортировать методы по частоте использования (по вашему мнению)
# append(el), sort(key, reverse), pop(idx), insert(idx, el), extend(el), remove(el),  reverse()
# 4. Прокомментировать свой выбор
# чаще всего используется - ввод нового элемента в список, сортировка этого списка, удаление элемента из списка,
# вставка элемента  - для создания новых списков, их коррекции, а остальные  - это скорее дополнительные методы
# работы со списками.